In [6]:
# Recap
var_1 = "words" # string
var_2 = 10 # integer
var_3 = 10.1 # float
var_4 = [10,10,0,"10"] # list
var_5 = {"key_1":var_1,
         "key_2":var_4} # dictionary

print(var_5["key_1"])
print(var_5.items())
print(var_5.keys())
print(var_5.values())

words
dict_items([('key_1', 'words'), ('key_2', [10, 10, 0, '10'])])
dict_keys(['key_1', 'key_2'])
dict_values(['words', [10, 10, 0, '10']])

In [ ]:
# pandas - used for tabular data
# packages have other code already built
# only use the minimum number of packages required (slower)

import pandas as pd # importing pandas with the alias pd
# import os # allows you to use file paths on operating system
# filepath = "c://shared_drive...csv"

# pandas can also read filepaths that are urls
# % symbols are non-standard - need to read as literal string
filepath = r"https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/1980%202023%20average%20house%20prices.csv"

house_prices = pd.read_csv(filepath) # pd.read_excel() - bit more complex as need to select sheet(s)
type(house_prices) # dataframe means tabular data

# standard variable name for dataframes is df (particulary if you only have one)

# house_prices.info() # table info
# house_prices.head(10) # first 5 rows is default
# house_prices.tail(10) # botton x rows

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
513,United Kingdom,2022-10,153.0,291637,-0.1,10.7
514,United Kingdom,2022-11,153.2,292187,0.2,9.3
515,United Kingdom,2022-12,152.2,290128,-0.7,8.2
516,United Kingdom,2023-01,150.4,286847,-1.1,5.2
517,United Kingdom,2023-02,149.6,285288,-0.5,4.7
518,United Kingdom,2023-03,148.2,282548,-1.0,3.2
519,United Kingdom,2023-04,148.9,283871,0.5,2.5
520,United Kingdom,2023-05,149.5,285053,0.4,1.6
521,United Kingdom,2023-06,151.2,288281,1.1,1.9
522,United Kingdom,2023-07,152.0,289824,0.5,0.6

In [ ]:
# Exercise 1
# import pandas as pd
filepath = r"https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/ChildIdentifiers.csv"
child_data = pd.read_csv(filepath)

# child_data.info()
# child_data.head(10)
# child_data.tail(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 332 entries, 0 to 331
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               332 non-null    int64
 1   LAchildID                332 non-null    object
 2   UPN                      332 non-null    object
 3   FormerUPN                0 non-null      float64
 4   UPNunknown               0 non-null      float64
 5   PersonBirthDate          332 non-null    object
 6   ExpectedPersonBirthDate  7 non-null      object
 7   GenderCurrent            332 non-null    int64
 8   PersonDeathDate          21 non-null     object
dtypes: float64(2), int64(2), object(5)
memory usage: 23.5+ KB

,Unnamed: 0,LAchildID,UPN,FormerUPN,UPNunknown,PersonBirthDate,ExpectedPersonBirthDate,GenderCurrent,PersonDeathDate
322,322,RND000498746591,A091808646442,NaN,NaN,2008-04-11,NaN,2,NaN
323,323,RND000044483554,A573619095658,NaN,NaN,2020-06-16,NaN,1,NaN
324,324,RND000110305262,A921047772424,NaN,NaN,2022-06-13,2011-06-03,1,NaN
325,325,RND000174662411,A648352689401,NaN,NaN,2005-08-08,NaN,50,NaN
326,326,RND000033895249,A471420782221,NaN,NaN,2007-12-25,NaN,0,NaN
327,327,RND000112711501,A465246916125,NaN,NaN,2010-07-07,NaN,2,NaN
328,328,RND000513120794,A540014111973,NaN,NaN,2018-08-14,NaN,2,NaN
329,329,RND000541643134,A549582689058,NaN,NaN,2021-12-09,NaN,51,NaN
330,330,RND000404939452,A889492349196,NaN,NaN,2013-07-23,NaN,2,NaN
331,331,RND000589802835,A877624860226,NaN,NaN,2021-10-25,NaN,9,NaN

In [ ]:
# house_prices

# datetime/datetime object
house_prices["Period_dt"] = pd.to_datetime(house_prices["Period"], format="%Y-%m") # need to use correct dat format i.e. - UK vs US
house_prices["Period_dt"].info
print

<bound method Series.info of 0     1980-01-01
1     1980-02-01
2     1980-03-01
3     1980-04-01
4     1980-05-01
         ...
518   2023-03-01
519   2023-04-01
520   2023-05-01
521   2023-06-01
522   2023-07-01
Name: Period_dt, Length: 523, dtype: datetime64[ns]>

In [50]:
# Exercise 2
child_data["PersonBirthDate_dt"] = pd.to_datetime(child_data["PersonBirthDate"], format="%Y-%m-%d")
child_data["ExpectedPersonBirthDate_dt"] = pd.to_datetime(child_data["ExpectedPersonBirthDate"], format="%Y-%m-%d")
child_data["PersonDeathDate_dt"] = pd.to_datetime(child_data["PersonDeathDate"], format="%Y-%m-%d", errors="coerce")
# child_data["PersonBirthDate_dt"].info
# child_data.info
child_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 332 entries, 0 to 331
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Unnamed: 0                  332 non-null    int64
 1   LAchildID                   332 non-null    object
 2   UPN                         332 non-null    object
 3   FormerUPN                   0 non-null      float64
 4   UPNunknown                  0 non-null      float64
 5   PersonBirthDate             332 non-null    object
 6   ExpectedPersonBirthDate     7 non-null      object
 7   GenderCurrent               332 non-null    int64
 8   PersonDeathDate             21 non-null     object
 9   PersonBirthDate_dt          332 non-null    datetime64[ns]
 10  ExpectedPersonBirthDate_dt  7 non-null      datetime64[ns]
 11  PersonDeathDate_dt          20 non-null     datetime64[ns]
dtypes: datetime64[ns](3), float64(2), int64(2), object(5)
memory usage: 31.3+ KB

In [68]:
# max, min, median, mean, sum etc.
max_change = house_prices["Percentage change (monthly) All property types"].max()
min_change = house_prices["Percentage change (monthly) All property types"].min()
sum_change = house_prices["Percentage change (monthly) All property types"].sum()
print(min_change)
print(max_change)
print(f"Max change: {max_change}, Min change: {min_change}")

median_price = house_prices["Average price All property types"].median()
mean_price = house_prices["Average price All property types"].mean()
print(median_price)
print(mean_price)

# slicing is making selection of rows based on defined conditions
condition = house_prices["Average price All property types"] < mean_price
less_than_mean = house_prices[condition]
less_than_mean

-4.79
13.29
Max change: 13.29, Min change: -4.79
97964.0
120570.55831739961

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types,Period_dt
0,United Kingdom,1980-01,10.11,19273,3.94,28.59,1980-01-01
1,United Kingdom,1980-02,10.11,19273,3.94,28.59,1980-02-01
2,United Kingdom,1980-03,10.11,19273,3.94,28.59,1980-03-01
3,United Kingdom,1980-04,10.51,20044,4.00,24.15,1980-04-01
4,United Kingdom,1980-05,10.51,20044,4.00,24.15,1980-05-01
...,...,...,...,...,...,...,...
269,United Kingdom,2002-06,59.43,113304,4.09,17.41,2002-06-01
270,United Kingdom,2002-07,59.90,114214,0.80,14.25,2002-07-01
271,United Kingdom,2002-08,61.23,116743,2.21,16.78,2002-08-01
272,United Kingdom,2002-09,62.72,119576,2.43,19.61,2002-09-01
273,United Kingdom,2002-10,63.19,120486,0.76,22.99,2002-10-01

In [ ]:
#current_date = pd.to_datetime("today")
collection_end = pd.to_datetime("31/03/2025", format="%d/%m/%Y")
child_data["time_delta"] = collection_end - child_data["PersonBirthDate_dt"]
child_data["Age"] = child_data["time_delta"] / pd.Timedelta(365.25,"d") # not technically correct way to do this
child_data["Age"] = child_data["Age"].astype(int) # rounds down to closest integer
child_data

,Unnamed: 0,LAchildID,UPN,FormerUPN,UPNunknown,PersonBirthDate,ExpectedPersonBirthDate,GenderCurrent,PersonDeathDate,PersonBirthDate_dt,ExpectedPersonBirthDate_dt,PersonDeathDate_dt,time_delta,Age
0,0,RND000215205141,A850728973744,NaN,NaN,2019-12-06,NaN,1,NaN,2019-12-06,NaT,NaT,1942 days,5
1,1,RND000824303014,A141396438491,NaN,NaN,2011-04-27,NaN,9,NaN,2011-04-27,NaT,NaT,5087 days,13
2,2,RND000750143123,A929946861554,NaN,NaN,2017-06-06,2019-12-06,1,NaN,2017-06-06,2019-12-06,NaT,2855 days,7
3,3,RND000909164501,A612330267292,NaN,NaN,2014-10-03,NaN,0,NaN,2014-10-03,NaT,NaT,3832 days,10
4,4,RND000382171815,A604459366806,NaN,NaN,2019-09-25,NaN,2,NaN,2019-09-25,NaT,NaT,2014 days,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
327,327,RND000112711501,A465246916125,NaN,NaN,2010-07-07,NaN,2,NaN,2010-07-07,NaT,NaT,5381 days,14
328,328,RND000513120794,A540014111973,NaN,NaN,2018-08-14,NaN,2,NaN,2018-08-14,NaT,NaT,2421 days,6
329,329,RND000541643134,A549582689058,NaN,NaN,2021-12-09,NaN,51,NaN,2021-12-09,NaT,NaT,1208 days,3
330,330,RND000404939452,A889492349196,NaN,NaN,2013-07-23,NaN,2,NaN,2013-07-23,NaT,NaT,4269 days,11
331,331,RND000589802835,A877624860226,NaN,NaN,2021-10-25,NaN,9,NaN,2021-10-25,NaT,NaT,1253 days,3

In [ ]:
# Exercise 3
min_age = child_data["Age"].min()
max_age = child_data["Age"].max()
mean_age = child_data["Age"].mean()
median_age = child_data["Age"].median()
mode_age = child_data["Age"].mode()

print(mode_age)
print(max_age - min_age)

0    6
Name: Age, dtype: int64
18